# Створіть 2 змінні x та y з довільними значеннями;
# Створіть просту умовну конструкцію(звісно вона повинна бути в тілі ф-ції), під час виконання якої буде перевірятися рівність змінних x та y.
# Удоскональте конструкцію та додайте відповідні умови, які б при нерівності змінних х та у відповідь повертали різницю чисел.
# Повинні опрацювати такі умови:
# x > y;  відповідь - х більше ніж у на z
# x < y;  відповідь - у більше ніж х на z
# x==y.   відповідь - х дорівнює z

x = 3;
y = 10;

def balance(x, y):
	if x > y:
		print('{} more then {} for {}.'.format(x, y, x-y))
		return x - y
	elif x < y:
		print('{} less then {} for {}.'.format(x, y, y-x))
		return y - x
	else:
		print('{} equals {} end their sum is {}.'.format(x, y, x+y))
		return x + y
balance(x, y)